; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v6 - type_2 ?v5 - type_1)
 	      (pred_1 ?v2 - object ?v5 - type_1)
	      (pred_2 ?v6 - type_2 ?v8 - type_3)
	      (pred_4 ?v6 - type_2 ?v2 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v6 - type_2 ?v3 ?v1 - type_1)
       :precondition (and  (pred_3 ?v6 ?v3))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v3))))

   (:action op_2
       :parameters (?v6 - type_2 ?v4 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v7) (pred_3 ?v6 ?v7) (pred_2 ?v6 ?v8))
       :effect (and (pred_4 ?v6 ?v4 ?v8)
		    (not (pred_1 ?v4 ?v7)) 
		    (not (pred_2 ?v6 ?v8))))

   (:action op_1
       :parameters (?v6 - type_2 ?v4 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v4 ?v8) (pred_3 ?v6 ?v7))
       :effect (and (pred_1 ?v4 ?v7)
		    (pred_2 ?v6 ?v8)
		    (not (pred_4 ?v6 ?v4 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_02 obj_08 - type_2
obj_04 obj_05 obj_01 obj_03 - type_3
obj_07 obj_09 obj_11 obj_10 - type_1
obj_06 obj_12 obj_13 - object)
(:init
(pred_3 obj_02 obj_11)
(pred_2 obj_02 obj_04)
(pred_2 obj_02 obj_05)
(pred_3 obj_08 obj_10)
(pred_2 obj_08 obj_01)
(pred_2 obj_08 obj_03)
(pred_1 obj_06 obj_09)
(pred_1 obj_12 obj_11)
(pred_1 obj_13 obj_10)
)
(:goal
(and
(pred_1 obj_06 obj_09)
(pred_1 obj_12 obj_10)
(pred_1 obj_13 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_02 obj_10)))
)
)

; plan
1. (op_3 obj_02 obj_11 obj_07)
   deleted: (pred_3 obj_02 obj_11)
   added: (pred_3 obj_02 obj_07)
   goals met: 1 of 3
2. (op_2 obj_08 obj_13 obj_10 obj_03)
   deleted: (pred_1 obj_13 obj_10) (pred_2 obj_08 obj_03)
   added: (pred_4 obj_08 obj_13 obj_03)
   goals met: 1 of 3
3. (op_3 obj_08 obj_10 obj_11)
   deleted: (pred_3 obj_08 obj_10)
   added: (pred_3 obj_08 obj_11)
   goals met: 1 of 3
4. (op_1 obj_08 obj_13 obj_11 obj_03)
   deleted: (pred_4 obj_08 obj_13 obj_03)
   added: (pred_1 obj_13 obj_11) (pred_2 obj_08 obj_03)
   goals met: 2 of 3
5. (op_2 obj_08 obj_12 obj_11 obj_01)
   deleted: (pred_1 obj_12 obj_11) (pred_2 obj_08 obj_01)
   added: (pred_4 obj_08 obj_12 obj_01)
   goals met: 2 of 3
6. (op_3 obj_08 obj_11 obj_10)
   deleted: (pred_3 obj_08 obj_11)
   added: (pred_3 obj_08 obj_10)
   goals met: 2 of 3
7. (op_1 obj_08 obj_12 obj_10 obj_01)
   deleted: (pred_4 obj_08 obj_12 obj_01)
   added: (pred_1 obj_12 obj_10) (pred_2 obj_08 obj_01)
   goals met: 3 of 3
